import { flats } from "@src/assets";

export const deck = [
  {
    id: 1,
    type: "APARTMENT",
    apartment: {
      id: "abe42ce6",
      data: {
        photos: flats["1236920894"],
        description:
          "Уютная стандартная отделка. Апартаменты полностью укомплектованы мебелью и всей необходимой техникой бытовой и кухонной техникой.\n\n Функциональная планировка: Кухня-студия, совмещенная с просторной гостиной, спальня с собственной ванной и сан.узлом (сан.узлы так же полностью укомплектованы (См. фото)),\nпросторный холл, постирочная и сушильная зона.\n Панорамное остекление по всему периметру апартаментов. Видовые характеристики: футуристический вид на город.\n В ночное время огни небоскребов никого не оставят равнодушными. Москва Сити - это Москва будущего, строящийся международный деловой квартал из ультрасовременных небоскрёбов.",
        rentalPrice: 30000,
        roomsCount: 2,
        address: {
          coords: [55.756459, 37.64482],
          postal: "Москва, Большой Златоустинский переулок, 6с1",
        },
        floor: 3,
      },
    },
  },
  {
    id: 2,
    type: "APARTMENT",
    apartment: {
      id: "abe42c77",
      data: {
        photos: flats["1488213313"],
        description:
          "Уютная стандартная отделка. Апартаменты полностью укомплектованы мебелью и всей необходимой техникой бытовой и кухонной техникой.\n\n Функциональная планировка: Кухня-студия, совмещенная с просторной гостиной, спальня с собственной ванной и сан.узлом (сан.узлы так же полностью укомплектованы (См. фото)),\nпросторный холл, постирочная и сушильная зона.\n Панорамное остекление по всему периметру апартаментов. Видовые характеристики: футуристический вид на город.\n В ночное время огни небоскребов никого не оставят равнодушными. Москва Сити - это Москва будущего, строящийся международный деловой квартал из ультрасовременных небоскрёбов.",
        rentalPrice: 30000,
        roomsCount: 2,
        address: {
          coords: [55.756459, 37.64482],
          postal: "Москва, Большой Златоустинский переулок, 6с1",
        },
        floor: 3,
      },
    },
  },
  {
    id: 3,
    type: "APARTMENT",
    apartment: {
      id: "abe42c88",
      data: {
        photos: flats["1768312876"],
        description:
          "Уютная стандартная отделка. Апартаменты полностью укомплектованы мебелью и всей необходимой техникой бытовой и кухонной техникой.\n\n Функциональная планировка: Кухня-студия, совмещенная с просторной гостиной, спальня с собственной ванной и сан.узлом (сан.узлы так же полностью укомплектованы (См. фото)),\nпросторный холл, постирочная и сушильная зона.\n Панорамное остекление по всему периметру апартаментов. Видовые характеристики: футуристический вид на город.\n В ночное время огни небоскребов никого не оставят равнодушными. Москва Сити - это Москва будущего, строящийся международный деловой квартал из ультрасовременных небоскрёбов.",
        rentalPrice: 30000,
        roomsCount: 2,
        address: {
          coords: [55.756459, 37.64482],
          postal: "Москва, Большой Златоустинский переулок, 6с1",
        },
        floor: 3,
      },
    },
  },
  {
    id: 4,
    type: "APARTMENT",
    apartment: {
      id: "abe42c99",
      data: {
        photos: flats["1785401178"],
        description:
          "Уютная стандартная отделка. Апартаменты полностью укомплектованы мебелью и всей необходимой техникой бытовой и кухонной техникой.\n\n Функциональная планировка: Кухня-студия, совмещенная с просторной гостиной, спальня с собственной ванной и сан.узлом (сан.узлы так же полностью укомплектованы (См. фото)),\nпросторный холл, постирочная и сушильная зона.\n Панорамное остекление по всему периметру апартаментов. Видовые характеристики: футуристический вид на город.\n В ночное время огни небоскребов никого не оставят равнодушными. Москва Сити - это Москва будущего, строящийся международный деловой квартал из ультрасовременных небоскрёбов.",
        rentalPrice: 30000,
        roomsCount: 2,
        address: {
          coords: [55.756459, 37.64482],
          postal: "Москва, Большой Златоустинский переулок, 6с1",
        },
        floor: 3,
      },
    },
  },
  {
    id: 5,
    type: "APARTMENT",
    apartment: {
      id: "abe42c11",
      data: {
        photos: flats["1804463066"],
        description:
          "Уютная стандартная отделка. Апартаменты полностью укомплектованы мебелью и всей необходимой техникой бытовой и кухонной техникой.\n\n Функциональная планировка: Кухня-студия, совмещенная с просторной гостиной, спальня с собственной ванной и сан.узлом (сан.узлы так же полностью укомплектованы (См. фото)),\nпросторный холл, постирочная и сушильная зона.\n Панорамное остекление по всему периметру апартаментов. Видовые характеристики: футуристический вид на город.\n В ночное время огни небоскребов никого не оставят равнодушными. Москва Сити - это Москва будущего, строящийся международный деловой квартал из ультрасовременных небоскрёбов.",
        rentalPrice: 30000,
        roomsCount: 2,
        address: {
          coords: [55.756459, 37.64482],
          postal: "Москва, Большой Златоустинский переулок, 6с1",
        },
        floor: 3,
      },
    },
  },
];
